
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-11-20T12:06:48Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                           = "rd-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rddataextractaat|/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|1af59205-3568-496b-a1cc-87358714a358" -> (known after apply)
      ~ principal_id       = "1af59205-3568-496b-a1cc-87358714a358" -> "f0a367e1-7e08-42b5-81e4-c848787e6f1e" # forces replacement
      ~ principal_type     = "Group" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ schedule {
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] must be replaced
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rddataextractaat|/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|1af59205-3568-496b-a1cc-87358714a358" -> (known after apply)
      ~ principal_id       = "1af59205-3568-496b-a1cc-87358714a358" -> "f0a367e1-7e08-42b5-81e4-c848787e6f1e" # forces replacement
      ~ principal_type     = "Group" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ schedule {
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] must be replaced
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rddataextractaat|/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|1af59205-3568-496b-a1cc-87358714a358" -> (known after apply)
      ~ principal_id       = "1af59205-3568-496b-a1cc-87358714a358" -> "f0a367e1-7e08-42b5-81e4-c848787e6f1e" # forces replacement
      ~ principal_type     = "Group" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ schedule {
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":210,"Program":"tfcmt","SHA1":"","Vars":{}} -->